project/app/controllers/application_controller.rb

	def current_user
		token = bearer_token
		return nil unless token
		payload = TokiToki.decode(token)
		@current_user ||= User.find_by_login(payload[0]['sub'])
---
SELECT "users".* FROM "users" WHERE "users"."login" = $1 LIMIT $2  [["login", "bob"], ["LIMIT", 1]]