project/app/controllers/authentication_controller.rb

	def loginGuest
		if (User.exists?(login: params[:login]))
---
SELECT 1 AS one FROM "users" WHERE "users"."login" = $1 LIMIT $2  [["login", "bob"], ["LIMIT", 1]]

	def login42
		authenticator = Authenticator.new
		user_info = authenticator.auth42(params[:code])

		login = user_info[:login]
		name = user_info[:name]
		avatar_url = user_info[:avatar_url]
		email = user_info[:email]

		user = User.where(login: login)
		if user.empty?
			user = User.create!(
				login: login,
				name: name,
				email: email,
				otp_secret_key: ROTP::Base32.random,
			)
---
SELECT "users".* FROM "users" WHERE "users"."login" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["login", "hbrulin"], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" WHERE "users"."login" = $1 AND "users"."id" != $2 LIMIT $3  [["login", "hbrulin"], ["id", 2], ["LIMIT", 1]]
INSERT INTO "users" ("login", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["login", "hbrulin"], ["name", "Hélène Brulin"], ["created_at", "2020-11-11 17:45:10.143256"], ["updated_at", "2020-11-11 17:45:10.143256"]]