project/app/controllers/authentication_controller.rb

	def login42
		authenticator = Authenticator.new
		user_info = authenticator.auth42(params[:code])

		login = user_info[:login]
		name = user_info[:name]
		avatar_url = user_info[:avatar_url]
		email = user_info[:email]

		# Generate token...
		token = TokiToki.encode(login)
		# ... create user if it doesn't exist...
		user = User.where(login: login).first_or_create!(
			name: name,
			email: email,
			otp_secret_key: ROTP::Base32.random
		)

		user.avatar.attach(
			io: URI.open(avatar_url),
			filename: "#{login}.png",
			"content_type": "image/png",
		) if !user.avatar.attached?

		if user.two_fact_auth
			File.open("output", "w") do |file|
				begin
					user.update_attributes(:otp =>
						ROTP::HOTP.new(user.otp_secret_key).at(user.otp_count))
---
UPDATE "users" SET "updated_at" = $1 WHERE "users"."id" = $2  [["updated_at", "2020-11-11 17:45:11.178341"], ["id", 2]]