project/app/controllers/guilds_controller.rb

  def show
	@guild = Guild.find(params[:id])
---
SELECT "guilds".* FROM "guilds" WHERE "guilds"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]